 Linux: Какой сегодня по счету день в году

----------------------------------------
date '+%j'
----------------------------------------
 
Linux: Убить все процессы с одинаковым именем

----------------------------------------
killall -KILL имя_процесса
----------------------------------------


./configure && make && sudo make install — в наше время вредный совет…
это небезопасно и при сборке большого кол-ва софта таким методом, система преврашается в свалку.
в генте можно сделать оверлей и написать ебилд
в слаке есть buildpkg
в rpm-based есть вроде rpmbuild
и т.д.
